<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_11(7%EC%9B%9431%EC%9D%BC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
             {'yyyy-mm-dd': '2002-09-24'},
             {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [4]:
def extract_year(column):
  return column.split("-")[0] # 하나의 column을 받았을 때 전체값에서 "-"로 분류해서 list를 만들고 그의 첫번째 인자를 return한다.

In [7]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year) # apply함수를 이용해 column 생성

In [8]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [9]:
def get_age(year, current_year):
  return current_year - int(year) # 나이 구하기

In [10]:
df['age'] = df['year'].apply(get_age, current_year=2018)

In [11]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [12]:
def get_introduce(age, prefix, suffix):
  return prefix + str(age) + suffix # multiple parameter

In [16]:
df['introduce'] = df['age'].apply(get_introduce, prefix="I am ", suffix = " years old")

In [17]:
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   18  I am 18 years old
1  2002-09-24  2002   16  I am 16 years old
2  2005-12-20  2005   13  I am 13 years old

In [18]:
def get_introduce_2(row):
  return "I was born in "+str(row.year)+ " my age is " + str(row.age) # 여러개의 columns을 apply함수로 사용가능

In [19]:
df.introduce = df.apply(get_introduce_2, axis=1) # row에 모든 column 활용 가능

In [20]:
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13